apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_ble_adapter.c
#ifdef CONFIG_PM
      if (g_lp_stat.pm_lock_released == 0)
        {
          esp32s3_pm_lockrelease();
          g_lp_stat.pm_lock_released = 1;
        }
#endif
    }
}

/****************************************************************************
 * Name: btdm_sleep_exit_phase3_wrapper
 *
 * Description:
 *   ESP32-S3 BLE lightsleep callback function..
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void btdm_sleep_exit_phase3_wrapper(void)
{
#ifdef CONFIG_PM
  if (g_lp_stat.pm_lock_released)
    {
      esp32s3_pm_lockacquire();
      g_lp_stat.pm_lock_released = 0;
    }
#endif

  if (btdm_controller_get_sleep_mode() == ESP_BT_SLEEP_MODE_1)
    {
      if (g_lp_stat.phy_enabled == 0)
        {
          esp_phy_enable(PHY_MODEM_BT);
          g_lp_stat.phy_enabled = 1;
        }
    }

  if (g_lp_cntl.wakeup_timer_required && g_lp_stat.wakeup_timer_started)
    {
      esp_timer_stop(g_btdm_slp_tmr);
      g_lp_stat.wakeup_timer_started = 0;
    }

  while (btdm_sleep_clock_sync());
}

/****************************************************************************
 * Name: coex_wifi_sleep_set_hook
 *
 * Description:
 *   Set Wi-Fi/BT coexistence sleep.
 *
 * Input Parameters:
 *   sleep - True to set sleep, false otherwise.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void coex_wifi_sleep_set_hook(bool sleep)
{
}

/****************************************************************************
 * Name: coex_schm_register_btdm_callback_wrapper
 *
 * Description:
 *   This is a wrapper for registering a BTDM callback with the coexistence
 *   scheme. If the Wi-Fi and Bluetooth coexistence feature is enabled
 *   (CONFIG_ESPRESSIF_WIFI_BT_COEXIST), it calls the
 *   coex_schm_register_callback function with COEX_SCHM_CALLBACK_TYPE_BT
 *   and the provided callback. If the feature is not enabled, it returns 0.
 *
 * Input Parameters:
 *   callback - The callback function to register.
 *
 * Returned Value:
 *   If the coexistence feature is enabled, it returns the result of the
 *   coex_schm_register_callback function. Otherwise, it returns 0.
 *
 ****************************************************************************/

static int coex_schm_register_btdm_callback_wrapper(void *callback)
{
#if CONFIG_ESPRESSIF_WIFI_BT_COEXIST
  return coex_schm_register_callback(COEX_SCHM_CALLBACK_TYPE_BT, callback);
#else
  return 0;
#endif
}

/****************************************************************************
 * Name: coex_schm_status_bit_set_wrapper
 *
 * Description:
 *   Set coexistence status.
 *
 * Input Parameters:
 *   type   - Coexistence status type
 *   status - Coexistence status
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void coex_schm_status_bit_set_wrapper(uint32_t type, uint32_t status)
{
#ifdef CONFIG_ESPRESSIF_WIFI_BT_COEXIST
  coex_schm_status_bit_set(type, status);
#endif
}

/****************************************************************************
 * Name: coex_schm_status_bit_clear_wrapper
 *
 * Description:
 *   Clear coexistence status.
 *
 * Input Parameters:
 *   type   - Coexistence status type
 *   status - Coexistence status
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void coex_schm_status_bit_clear_wrapper(uint32_t type,
                                               uint32_t status)
{
#ifdef CONFIG_ESPRESSIF_WIFI_BT_COEXIST
  coex_schm_status_bit_clear(type, status);
#endif
}

/****************************************************************************
 * Name: coex_schm_interval_get_wrapper
 *
 * Description:
 *   This is a wrapper for coex_schm_interval_get. If the WiFi and Bluetooth
 *   coexistence feature is enabled (CONFIG_ESPRESSIF_WIFI_BT_COEXIST), it
 *   calls the function and returns its result. If not enabled, it returns 0.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   If the coexistence feature is enabled, it returns the result of the
 *   coex_schm_interval_get function. Otherwise, it returns 0.
 *
 ****************************************************************************/

static uint32_t coex_schm_interval_get_wrapper(void)
{
#if CONFIG_ESPRESSIF_WIFI_BT_COEXIST
  return coex_schm_interval_get();
#else
  return 0;
#endif
}

/****************************************************************************
 * Name: coex_schm_curr_period_get_wrapper
 *
 * Description:
 *   This is a wrapper for coex_schm_curr_period_get. If the WiFi and
 *   Bluetooth coexistence feature is enabled
 *   (CONFIG_ESPRESSIF_WIFI_BT_COEXIST), it calls the function and returns
 *   its result. If the feature is not enabled, it returns 1.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   If the coexistence feature is enabled, it returns the result of the
 *   coex_schm_curr_period_get function. Otherwise, it returns 1.
 *
 ****************************************************************************/

static uint8_t coex_schm_curr_period_get_wrapper(void)
{
#if CONFIG_ESPRESSIF_WIFI_BT_COEXIST
  return coex_schm_curr_period_get();
#else
  return 1;
#endif
}

/****************************************************************************
 * Name: coex_schm_curr_phase_get_wrapper
 *
 * Description:
 *   This is a wrapper for coex_schm_curr_phase_get. If the WiFi and
 *   Bluetooth coexistence feature is enabled
 *   (CONFIG_ESPRESSIF_WIFI_BT_COEXIST), it calls the function and returns
 *   its result. If the feature is not enabled, it returns NULL.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   If the coexistence feature is enabled, it returns the result of the
 *   coex_schm_curr_phase_get function. Otherwise, it returns NULL.
 *
 ****************************************************************************/

