apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_ble_adapter.c
void bt_wakeup_request_end(void)
{
  async_wakeup_request_end(BTDM_ASYNC_WAKEUP_SRC_VHCI);
}

/****************************************************************************
 * Name: coex_bt_wakeup_request
 *
 * Description:
 *   This function requests a coexistence Bluetooth wakeup. It calls the
 *   async_wakeup_request function with BTDM_ASYNC_WAKEUP_REQ_COEX as the
 *   argument.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   The result of the async_wakeup_request function.
 *
 ****************************************************************************/

static bool coex_bt_wakeup_request(void)
{
  return async_wakeup_request(BTDM_ASYNC_WAKEUP_REQ_COEX);
}

/****************************************************************************
 * Name: coex_bt_wakeup_request_end
 *
 * Description:
 *   This function ends a coexistence Bluetooth wakeup request. It calls the
 *   async_wakeup_request_end function with BTDM_ASYNC_WAKEUP_REQ_COEX as the
 *   argument.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void coex_bt_wakeup_request_end(void)
{
  async_wakeup_request_end(BTDM_ASYNC_WAKEUP_REQ_COEX);
  return;
}

/****************************************************************************
 * Name: get_time_us_wrapper
 *
 * Description:
 *   Wrapper function to get the current system time in microseconds. This
 *   function is placed in IRAM for faster execution and calls the underlying
 *   esp32s3_rt_timer_time_us() function.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   The current system time in microseconds as a 64-bit integer
 *
 ****************************************************************************/

static IRAM_ATTR int64_t get_time_us_wrapper(void)
{
  return esp_hr_timer_time_us();
}

/****************************************************************************
 * Name: assert_wrapper
 *
 * Description:
 *   Empty wrapper function for assertions. This function is placed in IRAM
 *   for faster execution. Currently implemented as a no-op function.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static IRAM_ATTR void assert_wrapper(void)
{
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Functions to be called by libbt
 ****************************************************************************/

/****************************************************************************
 * Name: malloc_ble_controller_mem
 *
 * Description:
 *   Allocates memory for the BLE controller using the kernel memory manager.
 *   If allocation fails, an error message is logged.
 *
 * Input Parameters:
 *   size - The number of bytes to allocate
 *
 * Returned Value:
 *   A pointer to the allocated memory on success, NULL on failure
 *
 ****************************************************************************/

void *malloc_ble_controller_mem(size_t size)
{
  void *p = kmm_malloc(size);

  if (p == NULL)
    {
      wlerr("Malloc failed");
    }

  return p;
}

/****************************************************************************
 * Name: get_ble_controller_free_heap_size
 *
 * Description:
 *   Returns the amount of free heap memory available for the BLE controller.
 *   This function queries the user heap to determine available memory.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   The number of free bytes in the user heap
 *
 ****************************************************************************/

uint32_t get_ble_controller_free_heap_size(void)
{
  return mm_heapfree(USR_HEAP);
}

/****************************************************************************
 * Name: esp32s3_bt_controller_init
 *
 * Description:
 *   Init  BT controller.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Zero (OK) is returned on success. A negated errno value is returned
 *   on failure.
 *
 ****************************************************************************/

int esp32s3_bt_controller_init(void)
{
  esp_bt_controller_config_t bt_cfg = BT_CONTROLLER_INIT_CONFIG_DEFAULT();
  esp_bt_controller_config_t *cfg = &bt_cfg;
  int i;
  int err;

  g_ble_int_count = 0;

  if (g_btdm_controller_status != ESP_BT_CONTROLLER_STATUS_IDLE)
    {
      wlerr("Invalid controller status");
      return ERROR;
    }

  if (cfg == NULL)
    {
      return -EINVAL;
    }

  if (cfg->controller_task_prio != ESP_TASK_BT_CONTROLLER_PRIO ||
      cfg->controller_task_stack_size < ESP_TASK_BT_CONTROLLER_STACK)
    {
      wlerr("Invalid controller task prioriy or stack size");
      return -EINVAL;
    }

  if (cfg->bluetooth_mode != ESP_BT_MODE_BLE)
    {
      wlerr("Controller only support BLE only mode");
      return ERROR;
    }

  if (cfg->bluetooth_mode & ESP_BT_MODE_BLE)
    {
      if ((cfg->ble_max_act <= 0) ||
          (cfg->ble_max_act > BT_CTRL_BLE_MAX_ACT_LIMIT))
        {
          wlerr("Invalid value of ble_max_act");
          return -EINVAL;
        }
    }

  if (cfg->sleep_mode == ESP_BT_SLEEP_MODE_1)
    {
      if (cfg->sleep_clock == ESP_BT_SLEEP_CLOCK_NONE)
        {
          wlerr("SLEEP_MODE_1 enabled but sleep clock not configured");
          return ERROR;
        }

      if (cfg->sleep_clock > ESP_BT_SLEEP_CLOCK_RTC_SLOW)
        {
          wlerr("SLEEP_MODE_1 is enabled but this sleep clock is not "
                "supported");
          return ERROR;
        }
    }

  cfg->controller_task_stack_size = CONFIG_ESPRESSIF_BLE_TASK_STACK_SIZE;
  cfg->controller_task_prio       = CONFIG_ESPRESSIF_BLE_TASK_PRIORITY;
  cfg->controller_task_run_cpu    = CONFIG_BT_CTRL_PINNED_TO_CORE;
  cfg->magic                      = ESP_BT_CTRL_CONFIG_MAGIC_VAL;

#if CONFIG_MAC_BB_PD
  esp_mac_bb_pd_mem_init();
#endif

  esp_phy_modem_init();

  esp_bt_power_domain_on();

