apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_ble_adapter.c
#ifdef CONFIG_PM
  if (g_lp_cntl.no_light_sleep)
    {
      esp_pm_lock_release(g_light_sleep_pm_lock);
    }

  if (g_lp_stat.pm_lock_released == 0)
    {
      esp32s3_pm_lockrelease();
      g_lp_stat.pm_lock_released = 1;
    }
  else
    {
      DEBUGPANIC();
    }
#endif

  return OK;
}

/****************************************************************************
 * Name: esp_bt_controller_get_status
 *
 * Description:
 *   Returns the status of the BT Controller
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   The current status (type esp_bt_controller_status_t)
 *
 ****************************************************************************/

esp_bt_controller_status_t esp_bt_controller_get_status(void)
{
  return g_btdm_controller_status;
}

/****************************************************************************
 * Name: esp32s3_vhci_host_check_send_available
 *
 * Description:
 *   Check if the host can send packet to controller or not.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   bool - true or false
 *
 ****************************************************************************/

bool esp32s3_vhci_host_check_send_available(void)
{
  if (g_btdm_controller_status != ESP_BT_CONTROLLER_STATUS_ENABLED)
    {
      return false;
    }

  return api_vhci_host_check_send_available();
}

/****************************************************************************
 * Name: esp32s3_vhci_host_send_packet
 *
 * Description:
 *   Host send packet to controller.
 *
 * Input Parameters:
 *   data - the packet pointer
 *   len  - the packet length
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void esp32s3_vhci_host_send_packet(uint8_t *data, uint16_t len)
{
  if (g_btdm_controller_status != ESP_BT_CONTROLLER_STATUS_ENABLED)
    {
      return;
    }

  async_wakeup_request(BTDM_ASYNC_WAKEUP_SRC_VHCI);

  api_vhci_host_send_packet(data, len);

  async_wakeup_request_end(BTDM_ASYNC_WAKEUP_SRC_VHCI);
}

/****************************************************************************
 * Name: esp32s3_vhci_register_callback
 *
 * Description:
 *   Register the vhci reference callback.
 *
 * Input Parameters:
 *   callback - struct defined by vhci_host_callback structure.
 *
 * Returned Value:
 *   status - success or fail
 *
 ****************************************************************************/

int esp32s3_vhci_register_callback(const esp_vhci_host_callback_t *callback)
{
  int ret = ERROR;
  if (g_btdm_controller_status != ESP_BT_CONTROLLER_STATUS_ENABLED)
    {
      return ret;
    }

  ret = api_vhci_host_register_callback(
            (const vhci_host_callback_t *)callback) == 0 ? 0 : -1;
  return ret;
}

/****************************************************************************
 * Name: esp_bt_get_lpclk_src
 *
 * Description:
 *   This function returns the source of the low power clock for the ESP
 *   Bluetooth controller. If the controller is not initialized or enabled,
 *   it returns ESP_BT_SLEEP_CLOCK_NONE. Otherwise, it returns the current
 *   low power clock selection.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   The source of the low power clock for the ESP Bluetooth controller.
 *
 ****************************************************************************/

esp_bt_sleep_clock_t esp_bt_get_lpclk_src(void)
{
  if (g_btdm_controller_status != ESP_BT_CONTROLLER_STATUS_INITED &&
      g_btdm_controller_status != ESP_BT_CONTROLLER_STATUS_ENABLED)
    {
      return ESP_BT_SLEEP_CLOCK_NONE;
    }

  return g_lp_cntl.lpclk_sel;
}
